; domain
(define (domain locate-victim)

(:requirements :strips :typing :equality :negative-preconditions)

(:types
    location
)

(:constants 
    red orange yellow green blue - thermal-signature
    probability1 probability2 probability3 probability4 probability5 - visibility-level
    lowdB highdB - dB-level

)

(:predicates
    (robot-at ?loc - location)
    (victim-at ?loc - location)
    (victim-found)
    (oxygen)
    (scan)
    (connected ?loc1 ?loc2 - location)
    (visibility ?loc - location ?vis - visibility-level)
    (noise-level ?loc - location ?level - dB-level)
    (thermal-reading ?loc - location ?reading - thermal-signature)
) 

(:action move 
    :parameters (?from ?to - location)
    :precondition (and 
        (robot-at ?from)
        (connected ?from ?to)
        (not(victim-found))
    )
    :effect(and 
        (not(robot-at ?from))
        (robot-at ?to)
        (scan)
)
)


(:action scan-victim
    :parameters (?loc - location )
    :precondition (and
        (robot-at ?loc)
        (thermal-reading ?loc red)
        (visibility ?loc probability5)
        (noise-level ?loc highdB)
        (scan)
    )
    :effect (and 
        (victim-at ?loc)
        (victim-found)
    )
)

(:action rescue
    :parameters (?loc - location )
    :precondition (and 
        (victim-found)
        (victim-at ?loc)
        
    )
    :effect (oxygen) 
)


)

; problem
(define(problem locate-victim-1)

(:domain locate-victim)

(:objects 
    room1 room2 room3 room4 room5 - location

)
(:init 
    (connected room1 room2)
    (connected room2 room3)
    (connected room3 room4)
    (connected room4 room5)

    (thermal-reading room4 red)
    (visibility room4 probability5)
    (noise-level room4 highdB)

    (robot-at room1)
    (victim-at room4)
)

(:goal (and
    (victim-found)
    (oxygen)
))

)

; plan
1. (move room1 room2)
   deleted: (robot-at room1)
   added: (robot-at room2) (scan)
   goals met: 0 of 2
2. (move room2 room3)
   deleted: (robot-at room2)
   added: (robot-at room3)
   goals met: 0 of 2
3. (move room3 room4)
   deleted: (robot-at room3)
   added: (robot-at room4)
   goals met: 0 of 2
4. (scan-victim room4)
   added: (victim-found)
   goals met: 1 of 2
5. (rescue room4)
   added: (oxygen)
   goals met: 2 of 2
